# 17
# Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Input: [1, 1, 2, 0, -1, 3, 4, 4]

# Output: 6

import random

# num = int(input("Введите количество элементов: "))
# n_lis = []

# for i in range (num):
#     n_lis.append(random.randint(1, num//2))

# a = set(n_lis)
# print(f"{n_lis} \n{a} \n{len(a)}")

# 19
# Дана последовательность из N целых чисел и число K. 
# Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо, K – положительное число.

# Input: [1, 2, 3, 4, 5] k = 2

# Output: [4, 5, 1, 2, 3]

# k = 3
# m = [1, 2, 3, 4, 5]

# for i in range(k):
#     m.insert(0, m[-1])
#     m.pop(-1)

# print(m)

# Напишите программу для печати всех уникальных значений в словаре.

# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, 
# {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]

# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# diction = {"I": "S001", "II": "S002", "III": "S001", "IV": "S005", \
# "V": "S005", "VI": "S009", " VII ": "S007"}

# new_diction = diction.values()

# print(set(new_diction))


# 23
# Дан массив, состоящий из целых чисел. Напишите программу, 
# которая подсчитает количество элементов массива, больших предыдущего (элемента с предыдущим номером)


# Input: [0, -1, 5, 2, 3]
# Output: 2

# пояснение
# (-1 < 5, 2 < 3)


a = [0, -1, 5, 2, 3, 5, 2, 3, 7, 4]
count = 0

for i in range(1, len(a)):
    if a[i - 1] < a[i]:
        count += 1

print(a)
print(count)